# AnalyticalModelTopExtensionMethod Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AnalyticalModelTopExtensionMethod Property
ParameterTypeId Class See Also
---
"Top Extension Method"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AnalyticalModelTopExtensionMethod { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalModelTopExtensionMethod As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AnalyticalModelTopExtensionMethod {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace